package D_250616.ch10;

// DAO(Data Access Object) : DB에 접근하는 기능 모음집
// CRUD, 검색, 한명 조회, 필터 등
// 인터페이스를 만들기 -> 이걸 구현하는 클래스 형식 -> 느슨한 결합 작업
// 스프링의 기본 뼈대 작업 방식

// DTP(Data Transfer Object) : DB에 전달하는 모델 클래스
// 데이터베이스, 회원의 정보를 각각 따로 전달하기보다는, 모델 클래스에 달아서, 인스턴스로 전달

public class _9DAO_Inaterface {
// 자바 특성, 클래스 끼는 단일 상속만 가능해서
// 다양한 기능을  추가하는데 한계가 있음.    
// 인터페이스는 다중 구현이 가능하게, 여러 기능 구현시, 굉장히 많이 사용함.

// 장점
// 1) 사용하는 메소서드들의 명세서(목록),ㅣ= 파악 쉽고,
// 2_ 유지보수가 편함.
// 3) 유지보수시, 코드의 변경 및 적용이 적습니다.

// 단점
// 1) 복잡도 증가
// 2) 소규모에서는 따로 분리를 안하려는 경함도 있음











}
